Also seeing this error when using v4.23.0 of the provider.

```
Terraform v1.2.5
on linux_amd64
+ provider registry.terraform.io/hashicorp/aws v4.23.0
```

```
Terraform will perform the following actions:

  # module.core.aws_ec2_traffic_mirror_session.capture[0] will be updated in-place
  ~ resource "aws_ec2_traffic_mirror_session" "capture" {
        id                       = "tms-redacted"
        tags                     = {}
      ~ traffic_mirror_target_id = "tmt-redacted" -> (known after apply)
        # (9 unchanged attributes hidden)
    }

  # module.core.aws_ec2_traffic_mirror_session.capture[1] will be updated in-place
  ~ resource "aws_ec2_traffic_mirror_session" "capture" {
        id                       = "tms-redacted"
        tags                     = {}
      ~ traffic_mirror_target_id = "tmt-redacted" -> (known after apply)
        # (9 unchanged attributes hidden)
    }

  # module.core.aws_ec2_traffic_mirror_target.capture[0] must be replaced
-/+ resource "aws_ec2_traffic_mirror_target" "capture" {
      ~ arn                  = "arn:aws:ec2:redacted:traffic-mirror-target/tmt-redacted" -> (known after apply)
      ~ id                   = "tmt-redacted" -> (known after apply)
      ~ network_interface_id = "eni-redacted" -> (known after apply) # forces replacement
      ~ owner_id             = "redacted" -> (known after apply)
      - tags                 = {} -> null
      ~ tags_all             = {} -> (known after apply)
        # (1 unchanged attribute hidden)
    }

```